app/Http/Controllers/DayPlannerController.php

    public function index(Request $request)
    {
        // If date is provided in the GET request, redirect to show
        if ($request->has('date')) {
            return redirect()->route('day-planner.show', $request->date);
        }

        // Get all day plannings
        $plannedDays = DayPlanning::orderBy('date', 'asc')
            ->get()
            ->map(function ($planning) {
                // Use either date or scheduled_date based on which one exists
                $dateColumn = Schema::hasColumn('routes', 'date') ? 'date' : 'scheduled_date';

                return [
                    'date' => $planning->date,
                    'formatted_date' => Carbon::parse($planning->date)->format('d-m-Y'),
                    'routes_count' => Route::where($dateColumn, $planning->date)->count()
                ];
            });
---
select * from "day_plannings" order by "date" desc
select count(*) as aggregate from "routes" where "date" = '2025-04-22 00:00:00'

    public function store(Request $request)
    {
        $validated = $request->validate([
            'date' => 'required|date',
        ]);

        // Format date for storage
        $formattedDate = Carbon::parse($validated['date'])->format('Y-m-d');

        // Create or update a day planning record
        DayPlanning::updateOrCreate(
            ['date' => $formattedDate],
            ['notes' => $request->notes ?? null]
        );
---
insert into "day_plannings" ("date", "notes", "updated_at", "created_at") values ('2025-04-23 00:00:00', null, '2025-04-22 22:11:15', '2025-04-22 22:11:15')
select * from "day_plannings" where ("date" = '2025-04-23') limit 1