app/Http/Controllers/RouteController.php

select "locations".*, "route_location"."route_id" as "pivot_route_id", "route_location"."location_id" as "pivot_location_id", "route_location"."order" as "pivot_order" from "locations" inner join "route_location" on "locations"."id" = "route_location"."location_id" where "route_location"."route_id" in (1, 2, 4) order by "route_location"."order" asc, "route_location"."order" asc
---
    public function index()
    {
        $routes = Route::with(['locations' => function ($q) {
            $q->orderBy('route_location.order');
        }])->get();

delete from "route_location"
delete from "routes"
---
    public function deleteAll()
    {
        try {
            DB::beginTransaction();
            DB::table('route_location')->delete();
            Route::truncate();