app/Http/Controllers/RouteOptimizerController.php

    public function index()
    {
        // Get selected date from session
        $selectedDate = session('selected_date');

        // Debug: Log the selected date to see what's being used
        \Log::info('RouteOptimizer - Selected Date: ' . ($selectedDate ?? 'NULL'));

        // Get all locations first but filtered by date if available
        $locationsQuery = Location::orderBy('name');
        if ($selectedDate) {
            // Ensure the selected date is refreshed in the session with each view
            session(['selected_date' => $selectedDate]);

            // Use the new scope for consistency
            $locationsQuery->forDate($selectedDate);
        }
        $allLocations = $locationsQuery->get();

        // Use either date or scheduled_date based on which one exists
        $dateColumn = Schema::hasColumn('routes', 'date') ? 'date' : 'scheduled_date';

        if ($selectedDate) {
            // If we have a date filter, show only unassigned locations and
            // locations assigned to routes with this date
            $locationsForDate = Location::whereHas('routes', function($query) use ($selectedDate, $dateColumn) {
                $query->whereDate($dateColumn, $selectedDate);
            })->orderBy('name')->get();
---
select * from "locations" where ("date" = '2025-04-23' or "date" is null) order by "name" asc
select * from "locations" where exists (select * from "routes" inner join "location_route" on "routes"."id" = "location_route"."route_id" where "locations"."id" = "location_route"."location_id" and strftime('%Y-%m-%d', "date") = cast('2025-04-23' as text)) order by "name" asc