app/Http/Controllers/RouteController.php

select * from "routes" where strftime('%Y-%m-%d', "date") = cast('2025-04-23' as text) order by "created_at" desc
---
    public function index()
    {
        $selectedDate = session('selected_date');

        // Refresh the session date to ensure it persists across requests
        if ($selectedDate) {
            session(['selected_date' => $selectedDate]);
            \Log::info('RouteController@index - Refreshed selected_date: ' . $selectedDate);
        }

        // Use either date or scheduled_date based on which one exists
        $dateColumn = Schema::hasColumn('routes', 'date') ? 'date' : 'scheduled_date';

        $query = Route::orderBy('created_at', 'desc');

        // Apply date filter if we have a selected date
        if ($selectedDate) {
            $query->whereDate($dateColumn, $selectedDate);
        }

        $routes = $query->get();

select * from "locations" where "id" in (6, 7, 8, 11, 1, 5, 2, 12, 4, 9, 13, 10, 3)
select * from "routes"
---
    public function optimizeAllRoutes($returnJson = true)
    {
        try {
            // Get all routes without filtering by user_id
            $routes = Route::with('locations')->get();

select * from "locations" where "id" in (2, 12, 13, 10, 11, 3, 1, 9, 5, 4, 8, 7, 6)
---
                return false;
            }

            $locations = Location::whereIn('id', $locationIds)->get()->keyBy('id');

delete from "route_location" where "route_location"."route_id" = 9
insert into "route_location" ("location_id", "order", "route_id") values (2, 0, 9)
---
                foreach ($bestSolution as $routeId => $locationOrder) {
                    $route = $routes->firstWhere('id', $routeId);
                    if ($route) {
                        $route->locations()->detach();

                        // Attach locations in the optimized order
                        foreach ($locationOrder as $index => $locationId) {
                            $route->locations()->attach($locationId, ['order' => $index]);