app/Http/Controllers/RouteOptimizerController.php

    public function index()
    {
        $locations = Location::orderBy('name')->get();
---
select * from "locations" order by "name" asc